RIET/src/Documents/TR_Adjustment/TR_Adjustment.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>TR_Adjustment</name>
  <basedOn>Document.TransportRequest</basedOn>
  <registerRecords>AccumulationRegister.ParcelsOfTransportRequestsWithoutShipment</registerRecords>
  <attributes>
    <name>TR</name>
    <type>
      <types>DocumentRef.TransportRequest</types>
    </type>
  </attributes>
  <attributes>
    <name>Comments</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>CreatedBy</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>CreationDate</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ModifiedBy</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ModificationDate</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Parcels</name>
    <attributes>
      <name>Parcel</name>
      <type>
        <types>CatalogRef.Parcels</types>
      </type>
    </attributes>
    <attributes>
      <name>NumOfParcels</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>4</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

RIET/src/AccumulationRegisters/ParcelsOfTransportRequestsWithoutShipment/ParcelsOfTransportRequestsWithoutShipment.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ParcelsOfTransportRequestsWithoutShipment</name>
  <resources>
    <name>NumOfParcels</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Parcel</name>
    <type>
      <types>CatalogRef.Parcels</types>
    </type>
  </dimensions>
  <dimensions>
    <name>TransportRequest</name>
    <type>
      <types>DocumentRef.TransportRequest</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

RIET/src/InformationRegisters/StagesOfTransportRequests/StagesOfTransportRequests.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>StagesOfTransportRequests</name>
  <resources>
    <name>Stage</name>
    <type>
      <types>EnumRef.TransportRequestStages</types>
    </type>
  </resources>
  <resources>
    <name>ModificationDate</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <dimensions>
    <name>TransportRequest</name>
    <type>
      <types>DocumentRef.TransportRequest</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

RIET/src/Documents/TR_Adjustment/ObjectModule.bsl
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	РГСофт.ЗаполнитьModification(ЭтотОбъект);
	
	Если ЭтоНовый() Тогда	
		РГСофт.ЗаполнитьCreation(ЭтотОбъект);
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	ДвиженияParcelsOfTransportRequestsWithoutShipment = Движения.ParcelsOfTransportRequestsWithoutShipment;
	
	ДвиженияParcelsOfTransportRequestsWithoutShipment.Записывать = Истина;
	ДвиженияParcelsOfTransportRequestsWithoutShipment.Очистить();
	
	Блокировка = Новый БлокировкаДанных;
	ЭлементБлокировки = Блокировка.Добавить("РегистрНакопления.ParcelsOfTransportRequestsWithoutShipment");
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	ЭлементБлокировки.ИсточникДанных = Parcels;
	ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Parcel", "Parcel");
	Блокировка.Заблокировать();
	
	Для Каждого ТекСтрокаParcels Из Parcels Цикл
		
		Остаток = Документы.TR_Adjustment.ПроверитьОстатокПоПарселю(ТекСтрокаParcels.Parcel, TR, Ссылка);
		Если Остаток = 0 Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("На текущую дату по парселю "+ ТекСтрокаParcels.Parcel +" нет остатков");
			Отказ = Истина;
		ИначеЕсли Остаток < ТекСтрокаParcels.NumOfParcels Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("По парселю  "+ ТекСтрокаParcels.Parcel +" Невозможно списать больше чем " + Остаток);
			Отказ = Истина;
		КонецЕсли;
		
		Движение = ДвиженияParcelsOfTransportRequestsWithoutShipment.ДобавитьРасход();
		Движение.Период = Дата;
		Движение.Parcel = ТекСтрокаParcels.Parcel;
		Движение.TransportRequest = TR;
		Движение.NumOfParcels = ТекСтрокаParcels.NumOfParcels;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.TransportRequest") Тогда
		
		TR = ДанныеЗаполнения.Ссылка;
		
		Выборка = Документы.TR_Adjustment.ПолучитьОстатки(TR, ТекущаяДата());
		
		Результат = Выборка.Выполнить();
		Если Не Результат.Пустой() Тогда
			Parcels.Загрузить(Результат.Выгрузить());
		Иначе
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("По выбранному TR - " + TR + " нет остатков",ЭтотОбъект);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	NewStage = РегистрыСведений.StagesOfTransportRequests.ПолучитьTransportRequestStage(TR);
	
	УстановитьПривилегированныйРежим(Истина);
	
	МенеджерЗаписи = РегистрыСведений.StagesOfTransportRequests.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.TransportRequest = TR;
	МенеджерЗаписи.Stage = NewStage;
	МенеджерЗаписи.ModificationDate = Дата;
	МенеджерЗаписи.Записать(Истина);
	
КонецПроцедуры
